import type { TermsItem } from "../types";

export const termsForLocationInfo: TermsItem[] = [
  {
    index: 1,
    about: "목적",
    content: `본 약관은 회원(츄의 서비스 약관에 동의한 자를 말하며 이하 '회원'이라고 합니다)이 츄(이하 '회사'라고 합니다)가 제공하는 웹페이지의 서비스를 이용함에 있어 회원과 회사의 권리 및 의무, 기타 제반 사항을 정하는 것을 목적으로 합니다.`,
  },
  {
    index: 2,
    about: "가입 자격",
    content:
      "서비스에 가입할 수 있는 회원은 위치기반 서비스를 이용할 수 있는 이동전화 단말기의 소유자 본인이어야 합니다.",
  },
  {
    index: 3,
    about: "서비스 가입",
    content: `회사는 다음 각 호에 해당하는 가입신청을 승낙하지 않을 수 있습니다.
1. 실명이 아니거나 타인의 명의를 사용하는 등 허위로 신청하는 경우
2. 고객 등록 사항을 누락하거나 오기하여 신청하는 경우
3. 공공질서 또는 미풍양속을 저해하거나 저해할 목적을 가지고 신청하는 경우
4. 기타 회사가 정한 이용 신청 요건이 충족되지 않았을 경우`,
  },
  {
    index: 4,
    about: "이용약관의 효력 및 변경",
    content: `1. 본 약관은 서비스를 신청한 고객 또는 개인위치정보주체가 회사가 정한 소정의 절차에 따라 회원으로 등록함으로써 효력이 발생합니다.
2. 서비스를 신청한 고객 또는 개인위치정보주체가 온라인에서 본 약관을 모두 읽고 '동의' 버튼을 클릭하였을 경우 본 약관의 내용을 모두 읽고 이를 충분히 이해하였으며, 그 적용에 동의한 ...`,
  },
  {
    index: 5,
    about: "약관 외 준칙",
    content: `본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에 명시되지 아니한 사항에 대하여는 관계법령 및 건전한 거래관행에 따릅니다.`,
  },
  {
    index: 6,
    about: "서비스의 내용",
    content: `회사가 제공하는 서비스는 아래와 같습니다.
1. 서비스명: 오메추
2. 서비스내용: 맛집 검색 기능, 위치정보를 이용한 맛집 검색 기능`,
  },
  {
    index: 7,
    about: "서비스 이용요금",
    content: `1. 회사의 서비스는 무료 제공을 원칙으로 합니다.
2. 전항에도 불구하고 무선 서비스 이용 시 발생하는 데이터 통신료는 별도이며, 이 때 부과되는 데이터 통신료는 회원이 가입한 각 이동통신사의 정책에 따릅니다.
3. 멀티미디어 메시지 서비스(MMS) 등으로 게시물을 등록할 경우 발생하는 요금은 각 이동통신사의 요금정책에 따라 회원이 부담합니다.`,
  },
  {
    index: 8,
    about: "서비스내용 변경 통지 등",
    content: `회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 회원이 등록한 전자우편 주소로 이메일을 발송하여 서비스 내용의 변경 사항 또는 종료를 사전 일주일 전에 통지합니다.`,
  },
  {
    index: 9,
    about: "서비스이용의 제한 및 중지",
    content: `1. 회사는 아래 각 호에 해당하는 사유가 발생한 경우에는 회원의 서비스 이용을 제한하거나 중지시킬 수 있습니다.
 가. 회원이 회사의 서비스 운영을 고의 또는 과실로 방해하는 경우
 나. 서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우
 다. 전기통신사업법에 규정된 기간통신사업자가 서비스를 중지했을 경우
 라. 국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 서비스 이용에 지장이 있는 때
 마. 기타 중대한 사유로 회사가 서비스 제공을 지속하는 것이 곤란한 경우
2. 회사가 전항에 따라 서비스의 이용을 제한하거나 중지한 때에는 해당 사실을 인터넷 등에 공지하거나 고객에게 통지합니다. 다만 회사가 통제할 수 없는 사유로 인하여 서비스를 중지하게 되는 경우 이를 사후에 통지할수 있습니다.`,
  },
  {
    index: 10,
    about: "개인위치정보의 이용 또는 제공",
    content: `1. 회사가 개인위치정보를 이용하여 서비스를 제공하고자 하는 경우에는 본 약관에 대한 개인위치정보주체의 동의를 얻어야 합니다.
2. 회원 및 법정대리인의 권리와 그 행사 방법은 제소 당시 회원의 주소에 의하며, 주소가 없는 경우에는 거소를 관할하는 지방법원의 전속관할로 합니다. 다만, 제소 당시 회원의 주소 또는 거소가 분명하지 않거나 외국 거주자의 경우에는 민사소송법상의 관할법원에 제기합니다.
3. 회사는 회원의 사전 동의 없이 개인위치정보를 제3자에게 제공하지 않으며, 개인위치정보를 회원이 지정하는 제3자에게 제공하는 경우에는 개인위치정보를 수집한 당해 통신 단말장치로 매회 회원에게 제공받는 자, 제공 일시 및 제공목적을 즉시 통보합니다. 단, 아래 각 호에 해당하는 경우에는 회원이 미리 특정하여 지정한 통신 단말장치 또는 전자우편주소로 통보합니다.
가. 개인위치저보를 수집한 당해 통신단말장치가 문자, 음성, 또는 영상의 수신기능을 갖추지 아니한 경우나. 회원이 온라인 게시 등의 방법으로 통보할 것을 미리 요청한 경우
4. 회사는 위치정보의 보호 및 이용 등에 관한 법률 제16조 제2항에 근거하여 위치정보 수집·이용·제공사실 확인 자료를 자동으로 기록·보존하며, 해당 자료는 1년간 보관합니다.`,
  },
  {
    index: 11,
    about: "개인위치정보의 보유기간 및 이용기간",
    content: `회사는 위치기반서비스 제공을 위해 아래와 같이 개인위치정보를 보유합니다.
1. 본 약관 제4조에 따른 위치기반서비스 이용 및 제공 목적을 달성한 때에는 지체 없이 개인위치정보를 파기합니다.
2. 다만, 회원이 작성한 게시물 또는 콘텐츠와 함께 위치정보가 저장되는 서비스의 경우 해당 게시물 또는 콘텐츠 보관기간 동안 개인위치정보가 보관됩니다.
3. 그 외 위치기반서비스 제공을 위해 필요한 경우 이용 목적 달성을 위해 필요한 최소한의 기간 동안 개인위치정보를 보유할 수 있습니다.
4. 위 1, 2, 3항에도 불구하고 다른 법령 또는 위치정보법에 따라 보유해야 하는 정당한 사유가 있는 경우에는 그에 따릅니다.`,
  },
  {
    index: 12,
    about: "개인위치정보 주체의 권리",
    content: `1. 회원은 회사에 대하여 언제든지 개인위치정보를 이용한 위치기반서비스 제공 및 개인위치정보의 제3자 제공에 대한 동의의 전부 또는 일부를 철회할 수 있습니다. 이 경우 회사는 수집한 개인위치정보 및 위치정보 이용, 제공 사실 확인 자료를 파기합니다.
2. 회원은 회사에 대하여 언제든지 개인위치정보의 수집, 이용 또는 제공의 일시적인 중지를 요구할 수 있습니다.
3. 회원은 회사에 대하여 아래 각 호의 자료에 대한 열람 또는 고지를 요구할 수 있고, 당해 자료에 오류가 있는 경우에는 그 정정을 요구할 수 있습니다. 이 경우 회사는 정당한 사유 없이 회원의 요구를 거절할 수 없습니다.
가. 본인에 대한 위치정보 이용, 제공사실 확인자료
나. 본인의 개인위치정보가 제3자에게 제공된 이유 및 내용
4. 회원은 회사가 정한 절차에 따라 제1항 내지 제3항의 권리를 행사할 수 있습니다.`,
  },
  {
    index: 13,
    about: "위치정보관리책임자의 지정",
    content: `1. 회사는 위치정보를 적절히 관리, 보호하고 개인위치정보주체의 불만을 원활히 처리할 수 있도록 실질적인 책임을 질 수 있는 지위에 있는 자를 위치정보의 관리책임자로 지정하고 운영합니다.
2. 회사의 위치정보관리책임자는 위치기반서비스의 제공에 관한 제반 사항을 담당·관리하는 부서의 총괄팀장으로서, 구체적인 사항은 본 약관의 부칙에 따릅니다.`,
  },
  {
    index: 14,
    about: "손해배상",
    content: `1. 회사가 위치정보의 보호 및 이용 등에 관한 법률 제15조 내지 제26조의 규정을 위반한 행위를 하여 회원에게 손해가 발생한 경우 회원은 회사에 대하여 손해배상 청구를 할 수 있습니다.
2. 회원이 고의 또는 과실로 본 약관의 규정을 위반하여 회사에 손해가 발생한 경우 회원은 회사에 발생한 모든 손해를 배상해야 합니다.`,
  },
  {
    index: 15,
    about: "면책",
    content: `1. 회사는 다음 각 호의 사유로 서비스를 제공할 수 없는 경우 이로 인하여 회원에게 발생한 손해에 대한 책임을부담하지 않습니다.
가. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우
나. 제3자의 고의적인 서비스 방해가 있는 경우
다. 회원의 귀책사유로 서비스 이용에 장애가 있는 경우
라. 기타 회사의 고의 또는 과실이 없는 사유에 해당하는 경우
2. 회사는 서비스 및 서비스에 게재된 정보, 자료, 사실의 신뢰도 및 정확성 등에 대한 보증을 하지 않으며 이로 인하여 회원에게 발생한 손해에 대하여 책임을 부담하지 않습니다.
3. 회사는 회원이 서비스를 이용하며 기대하는 수익을 상실한 것에 대한 책임과, 그 밖의 서비스를 통하여 얻은 자료로 인하여 회원에게 발생한 손해에 대한 책임을 부담하지 않습니다.`,
  },
  {
    index: 16,
    about: "분쟁의 조정",
    content: `1. 회사는 위치정보와 관련된 분쟁에 대해 당사자 간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 '위치정보의 보호 및 이용 등에 관한 법률' 제28조의 규정에 따라 방송통신위원회에 재정을 신청할 수 있습니다.
2. 회사 또는 고객은 위치정보와 관련된 분쟁에 대해 당사자 간 협의가 이루어지지 아니하거나 협의를 할 수 없는 경우에는 '개인정보보호법' 제43조의 규정에 따라 개인정보분쟁조정위원회에 조정을 신청할 수 있습니다.`,
  },
  {
    index: 17,
    about: "운영자 정보 및 연락처",
    content: `회사의 상호 및 주소 등은 다음과 같습니다.
1. 운영팀명 : 츄♥
2. 대표자 : 이수현
3. 주소 : 서울 성동구 왕십리로 137
4. 연락처 : ssicssicsuh@gmail.com`,
  },
  {
    index: null,
    about: null,
    content: `부칙`,
  },
  {
    index: 1,
    about: "시행일",
    content: `본 약관은 2025.08.22.부터 시행합니다.`,
  },
  {
    index: 2,
    about: "위치정보관리책임자",
    content: `위치정보관리책임자를 기준으로 다음과 같이 지정합니다.
1. 소속 : 츄♥
2. 성명 : 이수현
3. 직책 : 기획자 / 대표자
4. 전화 : 010-2222-6633`,
  },
];
