// regionData [시도][시군구] = [동1, 동2, ...] 구조

export type RegionData = {
  [city: string]: {
    [district: string]: string[];
  };
};

export const regionData: RegionData = {
    "서울특별시": {
        "강남구": [
        "신사동","논현1동","논현2동","압구정동",
        "청담동","삼성1동","삼성2동","대치1동",
        "대치2동","대치4동","역삼1동","역삼2동",
        "도곡1동","도곡2동","개포1동","개포2동",
        "개포3동","개포4동","일원본동","일원1동",
        "수서동","세곡동"
        ],
        "강동구": [
        "강일동","상일1동","상일2동","명일1동",
        "명일2동","고덕1동","고덕2동","암사1동",
        "암사2동","암사3동","천호1동","천호2동",
        "천호3동","성내1동","성내2동","성내3동",
        "길동","둔촌1동","둔촌2동"
        ],
        "강북구": [
        "삼양동","미아동","송중동","송천동",
        "삼각산동","번1동","번2동","번3동",
        "수유1동","수유2동","수유3동","우이동","인수동"
        ],
        "강서구": [
        "염창동","등촌1동","등촌2동","등촌3동",
        "화곡본동","화곡1동","화곡2동","화곡3동",
        "화곡4동","화곡6동","화곡8동","우장산동",
        "가양1동","가양2동","가양3동","발산1동",
        "공항동","방화1동","방화2동","방화3동"
        ],
        "관악구": [
        "보라매동", "은천동", "성현동", "중앙동", "청림동",
        "행운동", "청룡동", "낙성대동", "인헌동", "남현동",
        "신림동", "신사동", "조원동", "미성동", "난곡동",
        "난향동"
        ],
        "광진구": [
        "화양동", "군자동", "광장동", "능동", "구의제1동",
        "구의제2동", "구의제3동", "자양제1동", "자양제2동", "자양제3동",
        "자양제4동", "중곡제1동", "중곡제2동", "중곡제3동", "중곡제4동"
        ],
        "구로구": [
        "신도림동", "구로1동", "구로2동", "구로3동", "구로4동",
        "구로5동", "가리봉동", "고척1동", "고척2동", "개봉1동",
        "개봉2동", "개봉3동", "오류1동", "오류2동", "항동",
        "수궁동"
        ],
        "금천구": [
        "가산동", "독산1동", "독산2동", "독산3동", "독산4동",
        "시흥1동", "시흥2동", "시흥3동", "시흥4동", "시흥5동"
        ],
        "노원구": [
        "월계1동", "월계2동", "월계3동", "공릉1동", "공릉2동",
        "하계1동", "하계2동", "중계본동", "중계1동", "중계2,3동",
        "중계4동", "상계1동", "상계2동", "상계3,4동", "상계5동",
        "상계6,7동", "상계8동", "상계9동", "상계10동"
        ],
        "도봉구": [
        "쌍문1동", "쌍문2동", "쌍문3동", "쌍문4동",
        "방학1동", "방학2동", "방학3동",
        "창1동", "창2동", "창3동", "창4동", "창5동",
        "도봉1동", "도봉2동"
        ],
        "동대문구": [
        "신설동", "용두동", "제기동", "전농1동", "전농2동",
        "답십리1동", "답십리2동", "장안1동", "장안2동", "청량리동",
        "회기동", "휘경1동", "휘경2동", "이문1동", "이문2동"
        ],
        "동작구": [
        "노량진1동", "노량진2동", "상도1동", "상도2동", "상도3동",
        "상도4동", "흑석동", "사당1동", "사당2동", "사당3동",
        "사당4동", "사당5동", "대방동", "신대방1동", "신대방2동"
        ],
        "마포구": [
        "공덕동", "아현동", "도화동", "용강동", "대흥동",
        "염리동", "신수동", "서강동", "서교동", "합정동",
        "망원1동", "망원2동", "연남동", "성산1동", "성산2동",
        "상암동"
        ],
        "서대문구": [
        "충현동", "천연동", "북아현동", "신촌동", "연희동",
        "홍제제1동", "홍제제2동", "홍제제3동",
        "홍은제1동", "홍은제2동",
        "남가좌제1동", "남가좌제2동",
        "북가좌제1동", "북가좌제2동"
        ],
        "서초구": [
        "서초1동", "서초2동", "서초3동", "서초4동", "잠원동",
        "반포본동", "반포1동", "반포2동", "반포3동", "반포4동",
        "방배본동", "방배1동", "방배2동", "방배3동", "방배4동",
        "양재1동", "양재2동", "내곡동"
        ],
        "성동구": [
        "왕십리도선동", "왕십리제2동", "마장동", "사근동", "행당제1동",
        "행당제2동", "응봉동", "금호1가동", "금호2·3가동", "금호4가동",
        "옥수동", "성수1가제1동", "성수1가제2동", "성수2가제1동", "성수2가제3동",
        "송정동", "용답동"
        ],
        "성북구": [
        "성북동", "삼선동", "동선동", "돈암1동", "돈암2동",
        "안암동", "보문동", "정릉1동", "정릉2동", "정릉3동",
        "정릉4동", "길음1동", "길음2동", "종암동", "월곡1동",
        "월곡2동", "장위1동", "장위2동", "장위3동", "석관동"
        ],
        "송파구": [
        "풍납1동", "풍납2동", "거여1동", "거여2동", "마천1동",
        "마천2동", "방이1동", "방이2동", "오륜동", "오금동",
        "송파1동", "송파2동", "석촌동", "삼전동", "가락본동",
        "가락1동", "가락2동", "문정1동", "문정2동", "장지동",
        "위례동", "잠실본동", "잠실2동", "잠실3동", "잠실4동",
        "잠실6동", "잠실7동"
        ],
        "양천구": [
        "목1동", "목2동", "목3동", "목4동", "목5동",
        "신월1동", "신월2동", "신월3동", "신월4동", "신월5동",
        "신월6동", "신월7동", "신정1동", "신정2동", "신정3동",
        "신정4동", "신정6동", "신정7동"
        ],
        "영등포구": [
        "영등포본동", "영등포동", "여의동", "당산제1동", "당산제2동",
        "도림동", "문래동", "양평제1동", "양평제2동", "신길제1동",
        "신길제3동", "신길제4동", "신길제5동", "신길제6동", "신길제7동",
        "대림제1동", "대림제2동", "대림제3동"
        ],
        "용산구": [
        "후암동", "용산2가동", "남영동", "청파동", "원효로1동",
        "원효로2동", "효창동", "용문동", "한강로동", "이촌1동",
        "이촌2동", "이태원1동", "이태원2동", "한남동", "서빙고동",
        "보광동"
        ],
        "은평구": [
        "녹번동", "불광제1동", "불광제2동", "갈현제1동", "갈현제2동",
        "구산동", "대조동", "응암제1동", "응암제2동", "응암제3동",
        "역촌동", "신사제1동", "신사제2동", "증산동", "수색동",
        "진관동"
        ],
        "종로구": [
        "청운효자동", "사직동", "삼청동", "부암동", "평창동",
        "무악동", "교남동", "가회동", "종로1·2·3·4가동", "종로5·6가동",
        "이화동", "혜화동", "창신제1동", "창신제2동", "창신제3동",
        "숭인제1동", "숭인제2동"
        ],
        "중구": [
        "소공동", "회현동", "명동", "필동", "장충동",
        "광희동", "을지로동", "신당동", "다산동", "약수동",
        "청구동", "신당제5동", "동화동", "황학동", "중림동"
        ],
        "중랑구": [
        "면목본동", "면목2동", "면목3·8동", "면목4동", "면목5동",
        "면목7동", "상봉1동", "상봉2동", "중화1동", "중화2동",
        "묵1동", "묵2동", "망우본동", "망우3동", "신내1동",
        "신내2동"
        ],
    },

//   부산광역시: [
//     "강서구", "금정구", "기장군", "남구", "동구",
//     "동래구", "부산진구", "북구", "사상구", "사하구",
//     "서구", "수영구", "연제구", "영도구", "중구", "해운대구",
//   ],
//   대구광역시: [
//     "군위군", "남구", "달서구", "달성군", "동구",
//     "북구", "서구", "수성구", "중구",
//   ],
//   인천광역시: [
//     "강화군", "계양구", "미추홀구", "남동구", "동구",
//     "부평구", "서구", "연수구", "옹진군", "중구",
//   ],
//   광주광역시: [
//     "광산구", "남구", "동구", "북구", "서구",
//   ],
//   대전광역시: [
//     "대덕구", "동구", "서구", "유성구", "중구",
//   ],
//   울산광역시: [
//     "남구", "동구", "북구", "울주군", "중구",
//   ],
//   세종특별자치시: [
//     "세종시",
//   ],
//   경기도: [
//     "가평군", "고양시 덕양구", "고양시 일산동구", "고양시 일산서구", "과천시",
//     "광명시", "광주시", "구리시", "군포시", "김포시",
//     "남양주시", "동두천시", "부천시", "성남시 분당구", "성남시 수정구",
//     "성남시 중원구", "수원시 권선구", "수원시 영통구", "수원시 장안구", "수원시 팔달구",
//     "시흥시", "안산시 단원구", "안산시 상록구", "안성시", "안양시 동안구",
//     "안양시 만안구", "양주시", "양평군", "여주시", "연천군",
//     "오산시", "용인시 기흥구", "용인시 수지구", "용인시 처인구", "의왕시",
//     "의정부시", "이천시", "파주시", "평택시", "포천시",
//     "하남시", "화성시",
//   ],
//   강원도: [
//     "강릉시", "고성군", "동해시", "삼척시", "속초시",
//     "양구군", "양양군", "영월군", "원주시", "인제군",
//     "정선군", "철원군", "춘천시", "태백시", "평창군",
//     "홍천군", "화천군", "횡성군",
//   ],
//   충청북도: [
//     "괴산군", "단양군", "보은군", "영동군", "옥천군",
//     "음성군", "제천시", "진천군", "청주시 상당구", "청주시 서원구",
//     "청주시 청원구", "청주시 흥덕구", "충주시",
//   ],
//   충청남도: [
//     "계룡시", "공주시", "금산군", "논산시", "당진시",
//     "보령시", "부여군", "서산시", "서천군", "아산시",
//     "예산군", "천안시 동남구", "천안시 서북구", "청양군", "태안군", "홍성군",
//   ],
//   전라북도: [
//     "고창군", "군산시", "김제시", "남원시", "무주군",
//     "부안군", "순창군", "완주군", "익산시", "임실군",
//     "장수군", "전주시 덕진구", "전주시 완산구", "정읍시", "진안군",
//   ],
//   전라남도: [
//     "강진군", "고흥군", "곡성군", "광양시", "구례군",
//     "나주시", "담양군", "목포시", "무안군", "보성군",
//     "순천시", "신안군", "여수시", "영광군", "영암군",
//     "완도군", "장성군", "장흥군", "진도군", "함평군",
//     "해남군", "화순군",
//   ],
//   경상북도: [
//     "경산시", "경주시", "고령군", "구미시", "군위군",
//     "김천시", "문경시", "봉화군", "상주시", "성주군",
//     "안동시", "영덕군", "영양군", "영주시", "영천시",
//     "예천군", "울릉군", "울진군", "의성군", "청도군",
//     "청송군", "칠곡군", "포항시 남구", "포항시 북구",
//   ],
//   경상남도: [
//     "거제시", "거창군", "고성군", "김해시", "남해군",
//     "밀양시", "사천시", "산청군", "양산시", "의령군",
//     "진주시", "창녕군", "창원시 마산합포구", "창원시 마산회원구", "창원시 성산구",
//     "창원시 의창구", "창원시 진해구", "통영시", "하동군", "함안군", "함양군", "합천군",
//   ],
//   제주특별자치도: [
//     "서귀포시", "제주시",
//   ],
};
