export const termsForService: {
  index: number;
  about: string;
  content: string;
}[] = [
  {
    index: 1,
    about: "목적",
    content:
      "이 약관은 츄 (이하 '회사'라고 합니다.)가 제공하는 제반 서비스의 이용과 관련하여 회사와 회원과의 권리, 의무 및 책임 사항, 기타 필요한 사항을 규정함을 목적으로 합니다.",
  },
  {
    index: 2,
    about: "정의",
    content: `이 약관에서 사용하는 주요 용어의 정의는 다음과 같습니다.
1. ‘서비스’라 함은 구현되는 단말기(PC, TV, 휴대형단말기 등의 각종 유무선 장치를 포함)와 상관없이 ‘이용자’가 이용할 수 있는 회사가 제공하는 제반 서비스를 의미합니다.
2. ‘이용자’란 이 약관에 따라 회사가 제공하는 서비스를 받는 ‘개인회원’ 및 '비회원'을 말합니다.
3. ‘개인회원’은 회사에 개인정보를 제공하여 회원등록을 한 사람으로, 회사로부터 지속적으로 정보를 제공받고 ‘회사’가 제공하는 서비스를 계속적으로 이용할 수 있는 자를 말합니다.
4. ‘비회원’은 회원가입 없이 회사가 제공하는 서비스를 이용하는 자를 말합니다.
5. ‘비밀번호’라 함은 회원이 부여받은 아이디와 일치되는 회원임을 확인하고 비밀의 보호를 위해 회원 자신이 정한 문자(특수문자 포함)와 숫자의 조합을 의미합니다.
6. ‘콘텐츠’란 정보통신망법의 규정에 따라 정보통신망에서 사용되는 부호·문자·음성·음향·이미지 또는 영상 등으로 정보 형태의 글, 사진, 동영상 및 각종 파일과 링크 등을 말합니다.`,
  },
  {
    index: 3,
    about: "약관 외 준칙",
    content: "이 약관에서 정하지 아니한 사항에 대해서는 법령 또 ...",
  },
];
